{
  "projects": [
    {
      "title": "BACK2BANDUNG",
      "description": "This website was developed as a final project for the NYU IDM Intro to Web Development course. This website is meant to be used as a catalog for the things I’m going to sell because I’m moving back to Indonesia in January of 2024. Here, the user can view all the things I’m selling including the photos, descriptions, and price. The user can use the cart functionality to order multiple items at once after signing up to the website using their email address. However, the website does not currently handle transactions and therefore the user is directed to contact me directly, either through email; text; or social media, in order to make a purchase.",
      "tags": ["web development"],
      "link": "https://barakakautsar.github.io/Intro-To-WebDev/Final_doc/index.html"
    },
    {
      "title": "Wordle, with a twist!",
      "description": "This was my final project for the NYU IDM Fall 2023 Creative Coding course. My final project is a recreation of the New York Times game Wordle but with my personal twist. Here, the user will play against a trained AI algorithm to see who can solve the puzzle with the least amount of attempts. The way the game works is the same with the original wordle game but based on how well the AI performs, you may have less than 6 attempts to guess the word correctly. My goal for this project is to incorporate the use of ML algorithms into my sketch, this is achieved through deploying the algorithm as an API and then accessing it through my p5js sketch.",
      "tags": ["machine learning", "p5.js"],
      "link": "https://editor.p5js.org/BarakaKautsar/sketches/1w3I153FE"
    },
    {
      "title": "Project 3",
      "description": "This is project 3",
      "tags": ["web-development"],
      "link": "https://github.com/BarakaKautsar"
    },
    {
      "title": "Project 4",
      "description": "This is project 4",
      "tags": ["data"],
      "link": "https://github.com/BarakaKautsar"
    },
    {
      "title": "Project 5",
      "description": "This is project 5",
      "tags": ["web-development"],
      "link": "https://github.com/BarakaKautsar"
    }
  ]
}
